In [7]:
import pandas as pd
import numpy as np

In [8]:
df = pd.read_csv('data_in/testdata.csv')

In [9]:
df

   BA_ID  GNN_ID
0  89842    8772
1   7035    2640
2   5503    4484
3    NaN    2677
4    395    9945
5    NaN    3929
6   7753    9818
7  PO880    6779
8   4474    8610

In [10]:
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.filter.html#pandas.DataFrame.filter
df = pd.DataFrame(np.array(([1,2,3], [4,5,6])),
                  index=['mouse', 'rabbit'],
                  columns=['one', 'two', 'three'])

In [14]:
df.filter(items=['one', 'three'])

        one  three
mouse     1      3
rabbit    4      6

In [17]:
df.filter(like='wo', axis=1)

        two
mouse     2
rabbit    5

In [18]:
df.filter(like='bb', axis=0)

        one  two  three
rabbit    4    5      6